primary-docs/prolegomena-to-any-future.org
#+STARTUP: hidestars

#+TITLE: Prolegomena to any future comprehensive open source media tutorial
#+OPTIONS: H:3
#+OPTIONS: toc:2

# #+OPTIONS: toc:nil


Quoting from [[http://en.wikipedia.org/wiki/Prolegomena_to_Any_Future_Metaphysics][Wikipedia:]]

#+BEGIN_QUOTE
"Kant declared that the Prolegomena are for the use of both learners
and teachers as an heuristic way to discover a science of
metaphysics. Unlike other sciences, metaphysics has not yet attained
universal and permanent knowledge. There are no standards to
distinguish truth from error. Kant asked, 'Can metaphysics even be
possible?'"
#+END_QUOTE

Can a comprehensive tutorial for media students looking to use open
source software even be possible?



#+TOC: headlines 2 
* Introduction
** Statement of Purpose
This document begins with a statement of its primary purpose: to
acquaint media arts students with using free, open source
software. Sounds simple, doesn't it? 

The reality is, inevitably, more complicated. What exactly are "media
arts?" Do you mean "multimedia arts?" And what kind of free software
are we talking about? Firefox? What concepts are involved
there--How to use a web browser? And why does it sometimes say "free"
software and other times say "open source?" There's [[free vs. open source software--a controversy?][a difference?]]

And what the hell does 'acquaint' mean?

None of these questions even begin to address the assumptions being made about
what is going to remain useful months or years from the time of this initial
writing, in late 2013.

So, some further explanation is needed. And to paraphrase 
[[http://quoteinvestigator.com/2011/05/13/einstein-simple/][(Roger Sessions apparently paraphrasing)]] Albert Einstein, you want the
simplest explanation for how to do something, "but not simpler." As that
cryptic allusion suggests, it all turns out to be not so simple, and
trying to explain how to use software can get complicated
pretty fast.

** some basic assumptions

In light of these complications, it can help any person doing the
explaining to have a sense of what her auditor (the explainee?)
already knows, in order to tailor the explanation to the shared
context of what you both already know. Since this document can't
(yet!) ask you what you already know, we're going to make a few
assumptions:

*** you have basic digitally literacy

Even if you have never heard the term, chances are you "digitally
literate." Some internet searches for what that means in 2013 turn up things like this...

- What the us government has to say: http://www.digitalliteracy.gov
- What some anonymous wikipedia administrators have to say:
  http://en.wikipedia.org/wiki/Digital_literacy

We can only speculate about how our understanding of this will change
in coming months and years ([[speculative fiction and philosophy--or what did we learn from sci-fi?][see speculative fiction--below]])

*** you may be accustomed to so-called right-brain thinking
Two, we are going to assume that you may have more training in "the
arts" than in "computers." The distinction may or may not be a
relevant one right now, but, a world where it is definitively NOT is
probably on the way. May this document help expedite the process.

*** you may be reading this on your own actual computer (probably a Mac)
Three, given that two is true, we might not be wrong in thinking that
you are working on--or at least as familiar with working on--a Mac as
any other computer. Why? Well, see [[novelist Neal Stephenson explains some computing history][this essay]] for some background.

Because this may be true, we can just for now state that there are
some extra complications with using some of the more "bleeding edge"
open source software out there, especially if you are only accustomed
to using the Mac GUI (huh? see [[some history, context and terminology][here]]).

DO NOT LET THIS DISSUADE YOU! It just means that you are going to
become more skilled at working with this powerful tool of metal,
glass, plastic and silicon. And for everyone who's seen Napolean
Dynamite, we can all attest to the importance of having skills.

It'll make a difference, also, if you are using your own computer,
as you will need to be able to get around it (and make changes)
freely. In short, here's one case where's it good to be an
administrator [see jargon].

