prolegomena-to-any-future.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Prolegomena to any future comprehensive open source media tutorial</title>
<!-- 2013-12-17 Tue 03:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="WORZONE"/>
</head>
<body>
<div id="content">
<h1 class="title">Prolegomena to any future comprehensive open source media tutorial</h1>
<p>
<a id="top" name="top"></a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Prolegomena to any future comprehensive open source media tutorial</h2>
<div class="outline-text-2" id="text-1">
<p>
Quoting from <a href="http://en.wikipedia.org/wiki/Prolegomena_to_Any_Future_Metaphysics">Wikipedia:</a>
</p>

<blockquote>
<p>
"Kant declared that the Prolegomena are for the use of both learners
and teachers as an heuristic way to discover a science of
metaphysics. Unlike other sciences, metaphysics has not yet attained
universal and permanent knowledge. There are no standards to
distinguish truth from error. Kant asked, 'Can metaphysics even be
possible?'"
</p>
</blockquote>

<p>
Can a comprehensive tutorial for media students looking to use open
source software even be possible?
</p>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Prolegomena to any future comprehensive open source media tutorial</a></li>
<li><a href="#sec-2">2. Introduction</a>
<ul>
<li><a href="#sec-2-1">2.1. Statement of Purpose</a></li>
<li><a href="#sec-2-2">2.2. some basic assumptions</a></li>
<li><a href="#sec-2-3">2.3. structure of document</a></li>
<li><a href="#sec-2-4">2.4. some suggestions on how to use this document</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Specific Software&#x2013;The What?</a>
<ul>
<li><a href="#sec-3-1">3.1. getting to the 'source'</a></li>
<li><a href="#sec-3-2">3.2. selected free software</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Gaining a deeper understanding&#x2013;The How?</a>
<ul>
<li><a href="#sec-4-1">4.1. everyone's an autodidact, or finding out what you need to know</a></li>
<li><a href="#sec-4-2">4.2. How does programming work?</a></li>
<li><a href="#sec-4-3">4.3. some history, context and terminology</a></li>
<li><a href="#sec-4-4">4.4. UNIX operating system concepts and command line skills</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Philosophy and thinking about software&#x2013;The Why?</a>
<ul>
<li><a href="#sec-5-1">5.1. where does your software come from?</a></li>
<li><a href="#sec-5-2">5.2. open source culture and organizaions</a></li>
<li><a href="#sec-5-3">5.3. critical perspectives from philosophy and elsewhere</a></li>
<li><a href="#sec-5-4">5.4. reflections specifically on art and computation</a></li>
<li><a href="#sec-5-5">5.5. before and after</a></li>
</ul>
</li>
<li><a href="#sec-6">6. notes about maintaining this document</a>
<ul>
<li><a href="#sec-6-1">6.1. document management</a></li>
<li><a href="#sec-6-2">6.2. set up the portal pages to be pithy so that they can link to more</a></li>
<li><a href="#sec-6-3">6.3. quicknotes, concepts, and discussions</a></li>
<li><a href="#sec-6-4">6.4. finding out more about "digital art"</a></li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Statement of Purpose</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This document begins with a statement of its primary purpose: to
acquaint media arts students with using free, open source
software. Sounds simple, doesn't it? 
</p>

<p>
The reality is, inevitably, more complicated. What exactly are "media
arts?" Do you mean "multimedia arts?" And what kind of free software
are we talking about? Firefox? What concepts are involved
there&#x2013;How to use a web browser? And why does it sometimes say "free"
software and other times say "open source?" There's <a href="#sec-5-1-1">a difference?</a>
</p>

<p>
And what the hell does 'acquaint' mean?
</p>

<p>
None of these questions even begin to address the assumptions being made about
what is going to remain useful months or years from the time of this
writing, in late 2013.
</p>

<p>
So, some further explanation is needed. And to paraphrase 
<a href="http://quoteinvestigator.com/2011/05/13/einstein-simple/">(Roger Sessions apparently paraphrasing)</a> Albert Einstein, you want the
simplest explanation for how to do something, "but not simpler." As that
cryptic allusion suggests, it all turns out to be not so simple, and
trying to explain how to use software can get complicated
pretty fast.
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> some basic assumptions</h3>
<div class="outline-text-3" id="text-2-2">
<p>
In light of these complications, it can help any person doing the
explaining to have a sense of what her auditor (the explainee?) already knows, in order to
tailor the explanation to the shared context of what you both already
know.  Since this document can't (yet) ask you what you already know,
we're going to make a few assumptions. You may:
</p>
</div>

<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> have basic digitally literacy</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Even if you have never heard the term, chances are you "digitally
literate." Some internet searches for what that means in 2013 turn up things like this&#x2026;
</p>

<p>
What the us government has to say:
<a href="http://www.digitalliteracy.gov">http://www.digitalliteracy.gov</a>
</p>

<p>
What some anonymous wikipedia administrators have to say:
<a href="http://en.wikipedia.org/wiki/Digital_literacy">http://en.wikipedia.org/wiki/Digital_literacy</a>
</p>

<p>
We can only speculate about how any of this will change in coming
months and years (<a href="#sec-5-5-2">see speculative fiction&#x2013;below</a>)
</p>
</div>
</div>
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> be accustomed to so-called right-brain thinking</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Two, we are going to assume that you may have more training in "the
arts" than in "computers." The distinction may or may not be a
relevant one right now, but, a world where it is definitively NOT is
probably on the way. May this document help expedite the process.
</p>
</div>
</div>
<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> be reading this on your own actual computer (probably a Mac)</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Three, given that two is true, we might not be wrong in thinking that
you are working on&#x2013;or at least as familiar with working on&#x2013;a Mac as
any other computer. Why? Well, see <a href="#sec-4-3-1">this essay</a> for some background.
</p>

<p>
Because this may be true, we can just for now state that there are
some complication with using some of the more "bleeding edge" open
source software out there, if you are only accustomed to using the
Mac GUI (huh? see <a href="#sec-4-4">here</a>).
</p>

<p>
DO NOT LET THIS DISSUADE YOU! It just means that you are going to
become more skilled at working with this powerful tool of metal,
glass, plastic and silicon. And for everyone who's seen Napolean
Dynamite, we can all attest to the importance of having skills.
</p>

<p>
It'll make a difference, also, if you are using your own computer,
as you will be need to be able to get around it (and make changes)
freely. In short, here's one case where's it good to be an
administrator [see jargon].
</p>
</div>
</div>
</div>
