primary-docs/prolegomena-to-any-future.org
**** _Supercollider_

Another popular programming environment originally designed with
audio in mind, Supercollider is now hosted on Github.


http://supercollider.sourceforge.net
**** _Csound_


one of the earliest computer music programs, based on the C
programming language, which is at the heart of the Unix operating
system. 

Not as interactive an environment as the Pd or Max, Csound requires
the ability to compile your C code before you can hear
something. Still worth investigating, especially as a means to learn
more about C, which remains a language worth learning.

http://www.csounds.com

http://en.wikipedia.org/wiki/Csound

**** _PWGL_

a Lisp-based environment for doing algorithmic composition, somewhat
in the Patcher tradition of Pd/Max. The focus here, is on potentially
creating attractive scores (the GL refers to the OpenGL standard)
using traditional and graphic notation.

A project full of potential for patient composers and those inclined
to work with Lisp. See Cicero's path for more.

http://www2.siba.fi/PWGL/

**** _MuseScore_
a music notation program I found compartively easy to learn and
begin creating scores with quickly.

http://musescore.org/en

http://en.wikipedia.org/wiki/Musescore

**** _LMMS_

**** _misc_. 

just to give you an idea of how much free software is out there, and
what the world of getting it looks like:
http://freecode.com/tags/soundaudio

*** image/video
**** _GIMP_

GIMP, whose unfortunate acronym stands for GNU Image
Manipulation Program, has been around for a long time, as part of GNU
package of free software. 

http://www.gimp.org 

http://www.gimp.org/tutorials/ 


It may be a while before Adobe's dominance in the visual media world
is seriously challenged, though its recent adoption of a new pricing
scheme for its Creative Suites products has attracted some [[https://videolan.org/vlc/][criticism]].

**** _Processing_

An important entry into the world of open source programming
environments for artists and non-programmers, Processing has been
around since 2001.


http://www.processing.org 


http://processing.org/tutorials/

see Cicero's path: can be used with Kinect via special open source
software tools that allow access to the motion-tracking capabilities
of the Kinect.
**** _Blender_

Another longstanding free software project, Blender is a 3D-graphics
environment that provides a fairly complex interface, at least for
any not already familiar with graphics software. Like many free
software packages, it has been used in commerical ventures (Spiderman
2, apparently). 

http://www.blender.org 

http://wiki.blender.org 
**** _VLC_ media player

More properly an application for streaming or playing back content in
wide array of formats, I have found VLC most useful for capturing (transcoding)
streams, say, from Youtube or other streaming sources.


https://videolan.org/vlc/

**** _open_ frameworks

I can only say I have heard good things about openframeworks, which
appears to be used by artists working largely with installations and
visual media. 

http://openframeworks.cc 

http://openframeworks.cc/tutorials/
*** text/other
**** _text_ or document-oriented
***** LibreOffice

The options for non-Microsoft word processing and office suite
software has seen some recent changes, with OpenOffice and
LibreOffice representing a kind of reconfiguring of the scene for
document-producing free software.

LibreOffice now comes as the default package on Linux systems, so that
is mentioned here, as I have no particular experience with it.

https://www.libreoffice.org/

***** Emacs


http://www.gnu.org/software/emacs/

Nominally just a text editor, Emacs is perhaps the original free software package, still actively
developed and maintained now since the mid-70s. To understand the
staying power of something seemingly as uninteresting as a text editor
may require some context and history. This history is very much bound
up in the trajectory of the free software movement (see more).

Since it was actually designed to be a kind of complete operating
system environment, it is not uncommon to hear complaints by diehard
users of having to "leave" Emacs to work in applications. 

It is primarily used now as a highly-configurable environment for developing programs
in a huge variety of languages, especially by those who have fully
adopted the Linux operating system. 

Ignoring the hyperbole of [[http://en.wikipedia.org/wiki/Editor_wars]["editor wars,"]] it's fair to say that the
debate of, essentially, what to type in when navigating around your
computer has given rise to factions and strife. I can say that,
despite its frustrations and learning curve, I am very glad for
having taken approximately 2 years to get the point of understanding
those who don't want to leave emacs.

Like many of the tools related to programming and text here, emacs is
most likely already installed in some form on your computer. I got
started using it on a Mac, with an implementation, Aquamacs, that makes
for a simplified learning experience for Mac users. 

I am happy to recommend it for those who want to take their
understanding of their computer and programming further. I am also
compelled to encourage patience: may your forebearance know no limits.

http://aquamacs.org

****** org-mode

There exist many "libraries" and utilities within emacs that have
been around for a long time. These allow Emacs to continue to be
adapted by people who still find working in raw text-based
environments critical to their productivity. And essentially org-mode
is one huge library within emacs that is designed to help programmers
be productive, which usually means typing text at a keyboard. 

As indication, this whole text was composed in org-mode, as kind of
raw text file, and automatically exported to HTML by using org-mode
facilities. 
