prolegomena-to-any-future.html
another popular programming environment originally designed with
audio in mind, Supercollider is also hosted on a notable code
repository, SourceForge, that will eventually want to become familiar
with. 
</p>

<p>
Having not personally used Supercollider, I can only attest to the
fact that I have heard good things&#x2013;both about and "from" it.
</p>

<p>
<a href="http://supercollider.sourceforge.net">http://supercollider.sourceforge.net</a>
</p>
</div>
</li>

<li><span class="underline">Csound</span><br/><div class="outline-text-5" id="text-3-2-1-4">
<p>
one of the earliest computer music programs, based on the C
programming language, which is at the heart of the Unix operating
system. 
</p>

<p>
Not as interactive an environment as the Pd or Max, Csound requires
the ability to compile your C code before you can hear
something. Still worth investigating, especially as a means to learn
more about C, which remains a language worth learning.
</p>

<p>
<a href="http://www.csounds.com">http://www.csounds.com</a>
</p>

<p>
<a href="http://en.wikipedia.org/wiki/Csound">http://en.wikipedia.org/wiki/Csound</a>
</p>
</div>
</li>
<li><span class="underline">PWGL</span><br/><div class="outline-text-5" id="text-3-2-1-5">
<p>
a Lisp-based environment for doing algorithmic composition, somewhat
in the Patcher tradition of Pd/Max. The focus here, is on potentially
creating attractive scores (the GL refers to the OpenGL standard)
using traditional and graphic notation.
</p>

<p>
A project full of potential for patient composers and those inclined
to work with Lisp. See Cicero's path for more.
</p>

<p>
<a href="http://www2.siba.fi/PWGL/">http://www2.siba.fi/PWGL/</a>
</p>
</div>
</li>

<li><span class="underline">MuseScore</span><br/><div class="outline-text-5" id="text-3-2-1-6">
<p>
a music notation program I found compartively easy to learn and
begin creating scores with quickly.
</p>

<p>
<a href="http://musescore.org/en">http://musescore.org/en</a>
</p>

<p>
<a href="http://en.wikipedia.org/wiki/Musescore">http://en.wikipedia.org/wiki/Musescore</a>
</p>
</div>
</li>
<li><span class="underline">misc</span>.<br/><div class="outline-text-5" id="text-3-2-1-7">
<p>
just to give you an idea of how much free software is out there, and
what the world of getting it looks like:
<a href="http://freecode.com/tags/soundaudio">http://freecode.com/tags/soundaudio</a>
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> image/video</h4>
<div class="outline-text-4" id="text-3-2-2">
</div><ol class="org-ol"><li><span class="underline">GIMP</span><br/><div class="outline-text-5" id="text-3-2-2-1">
<p>
GIMP, whose unfortunate acronym stands for GNU Image
Manipulation Program, has been around for a long time, as part of GNU
package of free software. 
</p>

<p>
<a href="http://www.gimp.org">http://www.gimp.org</a> 
</p>

<p>
<a href="http://www.gimp.org/tutorials/">http://www.gimp.org/tutorials/</a> 
</p>


<p>
It may be a while before Adobe's dominance in the visual media world
is seriously challenged, though its recent adoption of a new pricing
scheme for its Creative Suites products has attracted some <a href="https://videolan.org/vlc/">criticism</a>.
</p>
</div>
</li>



<li><span class="underline">Processing</span><br/><div class="outline-text-5" id="text-3-2-2-2">
<p>
An important entry into the world of open source programming
environments for artists and non-programmers, Processing has been
around since 2001.
</p>


<p>
<a href="http://www.processing.org">http://www.processing.org</a> 
</p>


<p>
<a href="http://processing.org/tutorials/">http://processing.org/tutorials/</a>
</p>

<p>
see Cicero's path: can be used with Kinect via special open source
software tools that allow access to the motion-tracking capabilities
of the Kinect.
</p>
</div>
</li>

<li><span class="underline">Blender</span><br/><div class="outline-text-5" id="text-3-2-2-3">
<p>
Another longstanding free software project, Blender is a 3D-graphics
environment that provides a fairly complex interface, at least for
any not already familiar with graphics software. Like many free
software packages, it has been used in commerical ventures (Spiderman
2, apparently). 
</p>

<p>
<a href="http://www.blender.org">http://www.blender.org</a> 
</p>

<p>
<a href="http://wiki.blender.org">http://wiki.blender.org</a> 
</p>
</div>
</li>

<li><span class="underline">VLC</span> media player<br/><div class="outline-text-5" id="text-3-2-2-4">
<p>
More properly an application for streaming or playing back content in
wide array of formats, I have found VLC most useful for capturing (transcoding)
streams, say, from Youtube or other streaming sources.
</p>


<p>
<a href="https://videolan.org/vlc/">https://videolan.org/vlc/</a>
</p>
</div>
</li>

<li><span class="underline">open</span> frameworks<br/><div class="outline-text-5" id="text-3-2-2-5">
<p>
I can only say I have heard good things about openframeworks, which
appears to be used by artists working largely with installations and
visual media. 
</p>

<p>
<a href="http://openframeworks.cc">http://openframeworks.cc</a> 
</p>

<p>
<a href="http://openframeworks.cc/tutorials/">http://openframeworks.cc/tutorials/</a>
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> text/other</h4>
<div class="outline-text-4" id="text-3-2-3">
</div><ol class="org-ol"><li><span class="underline">text</span> or document-oriented<br/><ol class="org-ol"><li>LibreOffice<br/><div class="outline-text-6" id="text-3-2-3-1-1">
<p>
The options for non-Microsoft word processing and office suite
software has seen some recent changes, with OpenOffice and
LibreOffice representing a kind of reconfiguring of the scene for
document-producing free software.
</p>

<p>
LibreOffice now comes as the default package on Linux systems, so that
is mentioned here, as I have no particular experience with it.
</p>

<p>
<a href="https://www.libreoffice.org/">https://www.libreoffice.org/</a>
</p>
</div>
</li>
<li>Emacs<br/><div class="outline-text-6" id="text-3-2-3-1-2">
<p>
<a href="http://www.gnu.org/software/emacs/">http://www.gnu.org/software/emacs/</a>
</p>

<p>
Nominally just a text editor, Emacs is perhaps the original free software package, still actively
developed and maintained now since the mid-70s. To understand the
staying power of something seemingly as uninteresting as a text editor
may require some context and history. This history is very much bound
up in the trajectory of the free software movement (see more).
</p>

<p>
Since it was actually designed to be a kind of complete operating
system environment, it is not uncommon to hear complaints by diehard
users of having to "leave" Emacs to work in applications. 
</p>

<p>
It is primarily used now as a highly-configurable environment for developing programs
in a huge variety of languages, especially by those who have fully
adopted the Linux operating system. 
</p>

<p>
Ignoring the hyperbole of <a href="http://en.wikipedia.org/wiki/Editor_wars">"editor wars,"</a> it's fair to say that the
debate of, essentially, what to type in when navigating around your
computer has given rise to factions and strife. I can say that,
despite its frustrations and learning curve, I am very glad for
having taken approximately 2 years to get the point of understanding
those who don't want to leave emacs.
</p>

<p>
Like many of the tools related to programming and text here, emacs is
most likely already installed in some form on your computer. I got
started using it on a Mac, with an implementation, Aquamacs, that makes
for a simplified learning experience for Mac users. 
</p>

<p>
I am happy to recommend it for those who want to take their
understanding of their computer and programming further. I am also
compelled to encourage patience: may your forebearance know no limits.
</p>

<p>
<a href="http://aquamacs.org">http://aquamacs.org</a>
</p>
</div>

<ol class="org-ol"><li>org-mode<br/><div class="outline-text-7" id="text-3-2-3-1-2-1">
<p>
There exist many "libraries" and utilities within emacs that have
been around for a long time. These allow Emacs to continue to be
adapted by people who still find working in raw text-based
environments critical to their productivity. And essentially org-mode
is one huge library within emacs that is designed to help programmers
be productive, which usually means typing text at a keyboard. 
</p>

<p>
As indication, this whole text was composed in org-mode, as kind of
raw text file, and automatically exported to HTML by using org-mode
facilities. 
</p>
</div>
</li></ol>
</li>

<li>LaTeX<br/><div class="outline-text-6" id="text-3-2-3-1-3">
<p>
