primary-docs/prolegomena-to-any-future.org
***** LaTeX

http://www.latex-project.org

Built on top of another one of the longstanding free
software projects, LaTeX (nothing to do with the gloves--it's
connected to the Greek word "techne") is a program for typesetting
documents. Huh? 

The purpose of typesetting at a computer may strike most casual computer
users as odd. This is because we tend to take for granted the reality
that the acronym "WYSIWYG" represents: "what you see is what you
get." That is, when typing a document using a program like Microsoft
Word, what you see on the screen is what pretty much exactly what
your document is going to look like. 

That a need for something else exists may only become apparent when
you can't get your document to look quite the way you want. This is
where TeX comes in, as you essentially "program a document:" working
with a text editor, you give TeX some commands along with your
text that will allow you greater control of precisely how you want your
document to look. The final document is produced after processing all
of your commands.

If you ever start to really care what your documents look like,
especially if, god forbid, some mathematical text is involved, you'll
see the need for LaTeX, which is ubiquitous in academia. 

If you have ever downloaded an article that looked like [[http://msp.ucsd.edu/Publications/isea-reprint.pdf][Miller Puckette's]] then TeX was probably involved somewhere. 

***** FreeMind mind mapping software

A useful tool for taking loosely-structured notes or as a project
management tool allowing for graph-like visualizations of image and
text.

Perhaps also significant here as a software project which is hosted
on Subversion, a website used for open source projects large and
small. The trouble of downloading and installing via the command line
is avoided by the availability of pre-compiled binaries [link]. But
you can acquaint yourself with the general look and feel of a project
maintained by a smaller community on a code repository.

You could even use this as an experiment in trying to "roll your
own;" that is "install from source" yourself. [link]

http://freemind.sourceforge.net/wiki/index.php/Main_Page 
***** wordpress.org (as opposed to wordpress.com)
see other for more programming-specific

**** _other_
***** applications of computational approaches
****** NetLogo

Quoting from Wikipedia, "NetLogo is an agent-based programming
language and integrated modeling environment." That is, it is useful
as an environment for setting up a vast number of complex interactions
among parts, which the user creates and can defines to be anything
from virtual ants to humans. 

The purpose, and it's relevance to students of interactive media, is
to make aid the study of interactions. Used as an educational tool,
one can run existing simulations developed by other researchers or
create one's own.



http://ccl.northwestern.edu/netlogo/ 
****** NLTK

The Natural Language ToolKit (NLTK) is designed to get you started
exploring the area of Natural Language Processing (NLP).

One of the best things about NLTK is that there is an excellent book
freely available (NLP with NLTK) that makes it possible to find out,
say, in what senses Jane Austen uses the word "monstrous" in Sense
and Sensibility (you'd be surprised).

NLTK is a great example of newer open source project with a
well-supported code base, and some of the best documentation going (a
whole textbook, published by O'Reilly). Since it is hosted on Github
you can also begin to get familiar with that repository. And most
important of all, it can be an easy way to start to learn how to
program in Python, without having to do a bunch of boring and
meaningless exercises (which appear to be all too necessary parts of
introductory programming texts).

[link] 

How can I install NLTK from the source code repository?  Most users
should install NLTK from a distribution. Please see the installation
instructions. However, if you need an up-to-the-minute version, then
you will have to install NLTK from the source repository. Once you've
downloaded this, you'll need to run the top level setup.py program to
install this version of NLTK on your machine.
***** programming languages and environments
****** the bash shell

For Mac users, this is, for simplicity's sake, equivalent to the
Terminal application, which you may never have had reason to use. 

But, if you are going to take seriously the task of using open source
software more and more, or even if you are just interested in
learning more about programming, the time is nigh.

Issues pertaining to understanding what a "shell" is and how to use
it, appear elsewhere in more detail. Suffice it to say that, the Bash
shell is already on your computer, and provides a way into the core
of the operating system.

See [link] for more details. Getting comfortable with this is important.
****** GNU/Linux--not just any software

This may be an odd term for you, but hopefully you have at least
heard of Linux. The word 'ecosystem' usually strikes me as a bit
dubious when applied willy-nilly to any kind of software environment,
but it really is applicable to the Linux, or GNU/Linux world. 

Skimming around the various other sections and coming back here will
probably be best, unless you are already especially motivated to
start using the Linux operating system. If you already are working on
a Mac, it is not terribly difficult to actually support both
operating systems, if you want a way to learn incrementally. [link]

However, if you are not totally comfortable working at the commandline
[link] you may want instead to start by getting used to that first,
by say doing some exercises, reading some tutorials, and maybe
learning to use a text editor, such as Emacs. It's a process, but one
that will eventually lead to you getting a better understanding of
your computer, and the real value (and challenges) of working with
open source software. [link]
****** Python

Python is one of the more popular programming languages, and happens
to be open source, as well. What that means when it comes to a
programming language may be a little unclear, which is ok for the
moment. If you are on a Mac, you most likely already "have"
Python. 

Using it with a dedicated "interpreter" [link] is probably best when
starting out, in which case you will want to download IDLE.

Here are some further (loosely organized) links to things dealing
with Python. 


******* "where is 'Python' and the various things it uses located?"

One example:
/Library/Frameworks/Python.framework/Versions/2.7/lib/python2.7/site-packages/nltk/metrics/distance.pyc

http://geosci.uchicago.edu/~rtp1/PrinciplesPlanetaryClimate/Python/pythonPortal.html

http://geosci.uchicago.edu/~rtp1/PrinciplesPlanetaryClimate/Python/pythonInstall.html

file:///Library/Frameworks/Python.framework/Versions/2.7/Resources/English.lproj/Documentation/glossary.html#term-interpreted

