prolegomena-to-any-future.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Gaining a deeper understanding&#x2013;The How?</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> everyone's an autodidact, or finding out what you need to know</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> the process (and science) of learning</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
There can be a lot to learn when trying to get comfortable and get
done what you need to get done with software. Some meditations on
cognition, mindfulness and problem-solving can be helpful, if only to
distract you from your problem long enough to figure it out
subconsciously. 
</p>

<p>
Some advice and ideas to think about:
</p>

<p>
Rather than reading something in isolation when we are learning a new
language or technique, we can take advantage of the immediate feedback
that working with an interactive environment provides. Since the
tutorials that are available often just skim the surface of what we're
really interested in, you may find that you get an idea about what
you'd really like to be able to do. this could either be the beginning
of brilliant idea and concrete learned outcome (as they might say in
an educational psychology classroom) or it might be a frustrating
digression through countless vaguely inspiring but ultimately
unhelpful online forums and help pages, since the needed technique
hasn't exactly been mentioned yet. 
</p>

<p>
Be a good steward of your time and know when to back-off the more
ambitious idea. You'll figure it out eventually. Better to get back
to the more narrow path you were being led down by the tutorial.
</p>
</div>
