primary-docs/prolegomena-to-any-future.org
**** food for thought

http://en.wikipedia.org/wiki/Metacognition

http://en.wikipedia.org/wiki/Learning_styles


The emphasis--and preference--here is freely available
information. Here's one notable exception, a book written about the
psychology of learning. The general idea behing the book, that there
is an approach to learning that we are usually not taught that may be
helpful. Thinking about thinking, metacognition, is a good way to get
where you need to go in as painless a way as possible.

http://www.amazon.com/gp/product/0201339919

For example:

She states the myths of conventional learning:

1.The basics must be learned so well that they become second nature.

2.Paying attention means being focused on one thing at a time.

3.Delaying gratification is important.

4.Rote memorization is necessary.

5.Forgetting is a problem.

6.Intelligence is knowing "what's out there."

7.There are right and wrong answers.


*** online resources

there's no shortage of websites and blogs devoted to teaching you
how to code, or at least talking about it long enought to capture your
attention and potentially monetize it. Such is the way of the
world. In general, the depth that full-blown books provide can be
advantageous. But the free availablity of information has its own
charm, (and more importantly, in many cases, moral weight).

http://happyhacker.org/gtmhh/gtmhh2.shtml#program

codeacademy[link]

http://programmersheaven.com/categories


** How does programming work? 
this is a potentially enormous subject. the least you might need to
know would be what is involved in how to get some source code that someone has
assembled to work on your computer. 
*** assorted concepts
**** _it's (a) Terminal_

Working on a Mac, you have access to something whose usefulness has
just not faded, despite the near-universal preference for colorful
visual interfaces mixing pictures and icons and all that we associate
with the modern operating system [link]

That people still use text-based interfaces, or even prefer them, may
strike many of us as a sign of self-imposed austerity. Why wouldn't
you want to use a mouse and see little icons and dropdown menus for
everything? 

The austere appearance of a command line interface, which the
Terminal is an example of, can intimidate or frustrate; it can seem
like a step back. 

Well, coming to see the value in another viewpoint when it comes to
interfaces may not happen immediately. But be aware that, despite the
lack of an appealing GUI, the CLI and the system of organization that
it exposes to you, embodies a certain clarity (at least for machines running Mac
OS X and Linux, which have a core based on the Unix operating
system) that won't make much sense right away. But just keep this
phrase in mind "everything is a file." [link]

[[http://en.flossmanuals.net/command-line/][FLOSS Manuals tutorial on the GNU/Linux Command line]]


http://ph7spot.com/musings/in-unix-everything-is-a-file

**** _compilation_
Right now this section is primarily links, and in some cases large
copied-in chunks of text. Compilation is not a subject that most
casual Mac users will be very familiar with. Feel free to return to
this section, or work through some of the Mac developer tutorials, to
help get your bearings down the road.
***** what's a compiler? 
http://www.compilers.net/paedia/compiler/index.htm
