prolegomena-to-any-future.html

<ol class="org-ol"><li>food for thought<br/><div class="outline-text-5" id="text-4-1-1-1">
<p>
<a href="http://en.wikipedia.org/wiki/Metacognition">http://en.wikipedia.org/wiki/Metacognition</a>
</p>

<p>
<a href="http://en.wikipedia.org/wiki/Learning_styles">http://en.wikipedia.org/wiki/Learning_styles</a>
</p>


<p>
The emphasis&#x2013;and preference&#x2013;here is freely available
information. Here's one notable exception, a book written about the
psychology of learning. The general idea behing the book, that there
is an approach to learning that we are usually not taught that may be
helpful. Thinking about thinking, metacognition, is a good way to get
where you need to go in as painless a way as possible.
</p>

<p>
<a href="http://www.amazon.com/gp/product/0201339919">http://www.amazon.com/gp/product/0201339919</a>
</p>

<p>
For example:
</p>

<p>
She states the myths of conventional learning:
</p>

<p>
1.The basics must be learned so well that they become second nature.
</p>

<p>
2.Paying attention means being focused on one thing at a time.
</p>

<p>
3.Delaying gratification is important.
</p>

<p>
4.Rote memorization is necessary.
</p>

<p>
5.Forgetting is a problem.
</p>

<p>
6.Intelligence is knowing "what's out there."
</p>

<p>
7.There are right and wrong answers.
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> online resources</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
there's no shortage of websites and blogs devoted to teaching you
how to code, or at least talking about it long enought to capture your
attention and potentially monetize it. Such is the way of the
world. In general, the depth that full-blown books provide can be
advantageous. But the free availablity of information has its own
charm, (and more importantly, in many cases, moral weight).
</p>

<p>
<a href="http://happyhacker.org/gtmhh/gtmhh2.shtml#program">http://happyhacker.org/gtmhh/gtmhh2.shtml#program</a>
</p>

<p>
codeacademy[link]
</p>

<p>
<a href="http://programmersheaven.com/categories">http://programmersheaven.com/categories</a>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> How does programming work?</h3>
<div class="outline-text-3" id="text-4-2">
<p>
this is a potentially enormous subject. the least you might need to
know would be what is involved in how to get some source code that someone has
assembled to work on your computer. 
</p>
</div>
<div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> assorted concepts</h4>
<div class="outline-text-4" id="text-4-2-1">
</div><ol class="org-ol"><li><span class="underline">it's (a) Terminal</span><br/><div class="outline-text-5" id="text-4-2-1-1">
<p>
Working on a Mac, you have access to something whose usefulness has
just not faded, despite the near-universal preference for colorful
visual interfaces mixing pictures and icons and all that we associate
with the modern operating system [link]
</p>

<p>
That people still use text-based interfaces, or even prefer them, may
strike many of us as a sign of self-imposed austerity. Why wouldn't
you want to use a mouse and see little icons and dropdown menus for
everything? 
</p>

<p>
The austere appearance of a command line interface, which the
Terminal is an example of, can intimidate or frustrate; it can seem
like a step back. 
</p>

<p>
Well, coming to see the value in another viewpoint when it comes to
interfaces may not happen immediately. But be aware that, despite the
lack of an appealing GUI, the CLI and the system of organization that
it exposes to you, embodies a certain clarity (at least for machines running Mac
OS X and Linux, which have a core based on the Unix operating
system) that won't make much sense right away. But just keep this
phrase in mind "everything is a file." [link]
</p>

<p>
<a href="http://ph7spot.com/musings/in-unix-everything-is-a-file">http://ph7spot.com/musings/in-unix-everything-is-a-file</a>
</p>


<p>
<i>FLOSS Manuals tutorial on the GNU/Linux Command line</i>
</p>
</div>
</li>

<li><span class="underline">compilation</span><br/><div class="outline-text-5" id="text-4-2-1-2">
<p>
Right now this section is primarily links, and in some cases large
copied-in chunks of text. Compilation is not a subject that most
casual Mac users will be very familiar with. Feel free to return to
this section, or work through some of the Mac developer tutorials, to
help get your bearings down the road.
</p>
</div>
<ol class="org-ol"><li>what's a compiler?<br/><div class="outline-text-6" id="text-4-2-1-2-1">
<p>
<a href="http://www.compilers.net/paedia/compiler/index.htm">http://www.compilers.net/paedia/compiler/index.htm</a>
</p>
</div>
<ol class="org-ol"><li>configure; make; make install<br/><div class="outline-text-7" id="text-4-2-1-2-1-1">
<p>
