prolegomena-to-any-future.html

<li><a href="http://en.flossmanuals.net/command-line/ch030_installing-software/">installing and compiling walk-through</a><br/><div class="outline-text-6" id="text-4-2-1-2-9">
</div>
</li></ol>
</li>
<li><span class="underline">operating systems</span><br/><div class="outline-text-5" id="text-4-2-1-3">
<p>
<a href="#sec-4-3-1">4.3.1</a>
</p>
</div>
</li>

<li><span class="underline">algorithms</span><br/><div class="outline-text-5" id="text-4-2-1-4">
<p>
<a href="#sec-3-2-3-2-4">3.2.3.2.4</a>
</p>
</div>
</li>

<li><span class="underline">data</span><br/><div class="outline-text-5" id="text-4-2-1-5">
<p>
see <a href="#sec-2-4-2">Cicero's path</a>
</p>
</div>
</li>

<li><span class="underline">software development</span><br/><ol class="org-ol"><li>qualities of a good programmer<br/><div class="outline-text-6" id="text-4-2-1-6-1">
<p>
taken straight from this blog entry
<a href="https://www.hackerschool.com/blog/27-fundamental-qualities-of-good-programmers">https://www.hackerschool.com/blog/27-fundamental-qualities-of-good-programmers</a>
</p>
</div>

<ol class="org-ol"><li>Knowing one programming language really well<br/><div class="outline-text-7" id="text-4-2-1-6-1-1">
<p>
Programming languages are just tools for telling computers what to do. It is better to have a strong command of one than a weak command of a bunch. Good programmers have at least one language that they know inside and out and can reach for to easily solve whatever problem is at hand.1
</p>
</div>
</li>
<li>Being a systematic debugger<br/><div class="outline-text-7" id="text-4-2-1-6-1-2">
<p>
Being a systematic debugger means that you have a good mental model of your code and that when you run into a bugthat is, when your program doesn't work as expectedyou generate hypotheses about what's wrong, instead of blindly changing things until your program works.
</p>
</div>
</li>
<li>Having a good mental model of your programming environment<br/><div class="outline-text-7" id="text-4-2-1-6-1-3">
<p>
Most programs interact with the outside world, so having an understanding of your environment is important. This includes the I/O and concurrency primitives that your language provides, the way your language finds, loads, compiles, and runs code, the way that your program gets info from the outside world (e.g., environmental variables and command line arguments), and the way your OS handles file access, device access, search paths, etc.
</p>
</div>
</li>
<li>Having a good mental model of the hardware you use<br/><div class="outline-text-7" id="text-4-2-1-6-1-4">
<p>
Knowing how your hardware works makes it easier to write efficient programs. Even if you are writing programs in a higher level language, understanding things like the call stack, the MMU, the cost of context switching, the memory hierarchy, and the characteristics of the network you are connected to will inform your programming decisions.
</p>
</div>
</li>
<li>Being comfortable with algorithmic thinking<br/><div class="outline-text-7" id="text-4-2-1-6-1-5">
<p>
A lot of people confuse algorithmic thinking with knowing a bunch of particular algorithms like quicksort or binary search.
</p>

<p>
An algorithm is a set of steps describing a calculation. Much of programming is simply describing algorithms to a computer. Being comfortable with algorithmic thinking means having good intuition for how to store and manipulate your data, being able to think both iteratively and recursively, and being able to reason about the performance characteristics of the code you write.
</p>
</div>
</li>
<li>Being comfortable with mathematical thinking<br/><div class="outline-text-7" id="text-4-2-1-6-1-6">
<p>
Programming is not as math-heavy as many non-programmers think, but as you start tackling tougher problems, you'll find that being comfortable with math comes in handy. Many interesting areas of programming like computer graphics, signal processing, and cryptography require a deep understanding of math. Even just measuring the performance of your code can require some statistical thinking.
</p>
</div>
</li>
<li>Being able to write a program from scratch<br/><div class="outline-text-7" id="text-4-2-1-6-1-7">
<p>
It is hard to imagine a good programmer who cannot write a program from scratch.
</p>
</div>
</li>
<li>Being able to work on a small piece of a large program<br/><div class="outline-text-7" id="text-4-2-1-6-1-8">
<p>
Most of the time you're not writing a program from scratch. Instead, you're working with other programmers on a large project.
</p>
</div>
</li>
<li>Knowing how to structure your code<br/><div class="outline-text-7" id="text-4-2-1-6-1-9">
<p>
Well-structured code allows you to easily navigate up and down through layers of abstraction. In a well-structured program, you can ignore implementation details when they don't matter and modify the implementation without having to make changes in all the places where the code is used.
</p>
</div>
</li>
<li>Having a large code radius<br/><div class="outline-text-7" id="text-4-2-1-6-1-10">
<p>
Code radius is a term that Alan came up with. Your code radius is the size of the largest program you're comfortable writing from scratch. Increasing your code radius takes practice. The structural tools that work well for a 500 line program are not necessarily the same as the ones that work for a 5,000 line program or a 50,000 line program.
</p>
</div>
</li>
<li>Being able to code quickly<br/><div class="outline-text-7" id="text-4-2-1-6-1-11">
<p>
Often times it's faster to try out a few different solutions and decide which is the most elegant than to figure out the correct one just by thinking about it. If you find "quickly" to be too subjective, consider the inverse: It's hard to imagine a good programmer who is slow.
</p>
</div>
</li>
<li>Being productive with your tools<br/><div class="outline-text-7" id="text-4-2-1-6-1-12">
<p>
Good programmers use their tools effectively. This doesn't mean you have to use all the tools available to you in order to be a good programmernot everyone likes IDEs and plenty of good programmers prefer printf to a debuggerjust that good programmers are productive with the tools they choose to use.
</p>
</div>
</li></ol>
</li></ol>
</li></ol>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> some history, context and terminology</h3>
<div class="outline-text-3" id="text-4-3">
</div><div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> novelist Neal Stephenson explains some computing history</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
with annotations from 2004
<a href="http://garote.bdmonkeys.net/commandline/">http://garote.bdmonkeys.net/commandline/</a>
</p>
</div>
</div>

<div id="outline-container-sec-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> terminology</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
also see <a href="#sec-3-1-1-1">3.1.1.1</a>
</p>
</div>
<ol class="org-ol"><li><span class="underline">software architecture</span><br/><div class="outline-text-5" id="text-4-3-2-1">
<p>
front-end/back-end terminology
   <a href="http://en.wikipedia.org/wiki/Front-end">"software
   architecture"</a> 
</p>
</div>
</li>

<li><span class="underline">explaining common things we encounter e.g. file types, file-endings</span><br/><div class="outline-text-5" id="text-4-3-2-2">
<p>
if you are seeing .app, or .dmg or .tar or .gz or .txt or NO
ending(?!) what does this mean? If you have been using different
applications on a mac that seem to consistently open some files with
a certain ending exclusively, then you have a nascent sense of what
file endings mean. And that means you are in a good position to
understand what compilation means. And what building means. And what
configuring means. And what installing means. And at least what
USING, most importantly for us as artists, means. 
</p>
</div>

<ol class="org-ol"><li>more file extensions in tables<br/><div class="outline-text-6" id="text-4-3-2-2-1">
<p>
So what other file extensions can you name, and what do you
understand about what they mean? 
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>

<col class="left"/>
</colgroup>
<tbody>
<tr>
<td class="left">.html</td>
<td class="left">webpages</td>
<td class="left">these are read by "web browsers"</td>
</tr>

<tr>
<td class="left">.mp3</td>
<td class="left">compressed audio</td>
<td class="left">audio players</td>
</tr>

<tr>
<td class="left">.wav</td>
<td class="left">uncompressed audio</td>
<td class="left">"</td>
</tr>

<tr>
<td class="left">.aiff</td>
<td class="left">uncompressed audio</td>
<td class="left">"</td>
</tr>

<tr>
<td class="left">.mpeg</td>
<td class="left">video</td>
<td class="left">media players</td>
</tr>

<tr>
<td class="left">.mov</td>
<td class="left">video</td>
<td class="left">"</td>
</tr>

<tr>
<td class="left">.jpg</td>
<td class="left">images</td>
<td class="left">image-viewing programs</td>
</tr>
</tbody>
</table>
<p>
.
</p>
</div>
</li></ol>
</li>
