prolegomena-to-any-future.html
Another key figure in the free software, er&#x2026;open source
movement. See Raymond's comments on Lisp
</p>

<p>
The Cathedral and the Bazaar
<a href="http://www.catb.org/~esr/writings/cathedral-bazaar/cathedral-bazaar/">http://www.catb.org/~esr/writings/cathedral-bazaar/cathedral-bazaar/</a>
</p>

<p>
Homesteading the Noosphere
<a href="http://www.catb.org/~esr/writings/cathedral-bazaar/homesteading/">http://www.catb.org/~esr/writings/cathedral-bazaar/homesteading/</a>
</p>
</div>
</li>

<li><span class="underline">Paul Graham</span><br/><div class="outline-text-5" id="text-5-1-2-4">
<p>
Of a different generation than the other two hackers, Graham is a
notable voice who has published many essays about the software world
that have a clarity of exposition and philosophical perspective that
makes them worthwhile reading for artists. As well, another prominent
Lisp programmer.
</p>

<p>
<a href="http://www.paulgraham.com/articles.html">http://www.paulgraham.com/articles.html</a>
</p>

<p>
Hackers and Painters
</p>

<blockquote>
<p>
"Painting was not, in Leonardo's time, as cool as his work helped make
it. How cool hacking turns out to be will depend on what we can do
with this new medium. " 
</p>
</blockquote>
<p>
<a href="http://www.paulgraham.com/hp.html">http://www.paulgraham.com/hp.html</a>
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-5-1-3" class="outline-4">
<h4 id="sec-5-1-3"><span class="section-number-4">5.1.3</span> misc. studies and writings</h4>
<div class="outline-text-4" id="text-5-1-3">
<p>
Questions from an economic perspective about the role of FLOSS are
worth considering, especially for how they either align or diverge
from the more radical model imagined by Stallman. Though this seemingly takes
us rather far afield from art-making, its relevance to the ways we get
our art-related softwar should be apparent. 
</p>

<p>
<a href="http://ocw.mit.edu/courses/sloan-school-of-management/15-352-managing-innovation-emerging-trends-spring-2005/readings/lakhaniwolf.pdf">http://ocw.mit.edu/courses/sloan-school-of-management/15-352-managing-innovation-emerging-trends-spring-2005/readings/lakhaniwolf.pdf</a>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> open source culture and organizaions</h3>
<div class="outline-text-3" id="text-5-2">
</div><div id="outline-container-sec-5-2-1" class="outline-4">
<h4 id="sec-5-2-1"><span class="section-number-4">5.2.1</span> the broader 'open source' movement</h4>
<div class="outline-text-4" id="text-5-2-1">
</div><ol class="org-ol"><li><span class="underline">Wikipedia links</span><br/><div class="outline-text-5" id="text-5-2-1-1">
<p>
Since thinking about software alone can get a little dry for many
people, knowing about some important figures who have been honored by
the FSF can cast the larger project in a more human light.
</p>

<p>
<a href="http://en.wikipedia.org/wiki/Free_Software_Foundation_Award_for_the_Advancement_of_Free_Software">http://en.wikipedia.org/wiki/Free_Software_Foundation_Award_for_the_Advancement_of_Free_Software</a>
</p>
</div>

<ol class="org-ol"><li>misc.<br/><div class="outline-text-6" id="text-5-2-1-1-1">
<p>
<a href="http://freedomdefined.org/Definition">http://freedomdefined.org/Definition</a>
</p>
</div>
</li></ol>
</li>
<li><span class="underline">Mark Tribe</span><br/><div class="outline-text-5" id="text-5-2-1-2">
<p>
A professor who teaches a course, which would fit well within PIMA,
on this very notion of open source culture. He posts many source
materials that should be of interest to your average PIMA MFA.
</p>

<p>
<a href="https://wiki.brown.edu/confluence/display/MarkTribe/Open+Source+Culture+Mediography">https://wiki.brown.edu/confluence/display/MarkTribe/Open+Source+Culture+Mediography</a>
</p>

<p>
<a href="https://wiki.brown.edu/confluence/display/MarkTribe/Mark+Tribe%27s+Teaching+Wiki">https://wiki.brown.edu/confluence/display/MarkTribe/Mark+Tribe%27s+Teaching+Wiki</a>
</p>

<p>
<a href="https://wiki.brown.edu/confluence/display/mcm1700n/Open+Source+Culture+Fall+12-+Syllabus">https://wiki.brown.edu/confluence/display/mcm1700n/Open+Source+Culture+Fall+12-+Syllabus</a>
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-5-2-2" class="outline-4">
<h4 id="sec-5-2-2"><span class="section-number-4">5.2.2</span> EFF</h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
If you do not know the name Lawrence Lessig, be aware that he, and
many others at the Electronic Frontier Foundation, are defending your digital rights.
<a href="https://www.eff.org">https://www.eff.org</a>
</p>

<p>
Another prominent voice defending freedom, in the software world and beyond.
john gilmore
<a href="http://www.toad.com/gnu/index.html">http://www.toad.com/gnu/index.html</a>
</p>
</div>
</div>

<div id="outline-container-sec-5-2-3" class="outline-4">
<h4 id="sec-5-2-3"><span class="section-number-4">5.2.3</span> FSF</h4>
<div class="outline-text-4" id="text-5-2-3">
<p>
see <a href="#sec-5-1-2">richard stallman</a>
</p>
</div>
</div>

<div id="outline-container-sec-5-2-4" class="outline-4">
<h4 id="sec-5-2-4"><span class="section-number-4">5.2.4</span> OSI</h4>
<div class="outline-text-4" id="text-5-2-4">
<p>
see <a href="#sec-5-1-2">Eric Raymond</a>
<a href="http://opensource.org/osi-open-source-education">http://opensource.org/osi-open-source-education</a>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> critical perspectives from philosophy and elsewhere</h3>
<div class="outline-text-3" id="text-5-3">
<p>
in some cases, this section serves to share some books that I think
are worth knowing about, especially if you are interested in the place
of computing in the humanities. In other cases, there are links to
particular thinkers or writers who voices seem to be prominent in the
ongoing evolution of the "digital everything" trend.
</p>
</div>

<div id="outline-container-sec-5-3-1" class="outline-4">
<h4 id="sec-5-3-1"><span class="section-number-4">5.3.1</span> 'digital culture and philosophy:' some proponents, influential figures and critics</h4>
<div class="outline-text-4" id="text-5-3-1">
</div><ol class="org-ol"><li><span class="underline">Scientists in computation, information theory and AI</span><br/><ol class="org-ol"><li>Wolfram<br/></li>
<li>Kurzweil<br/></li>
<li>Shannon-Weaver<br/></li>
<li>Winograd<br/></li></ol>
</li>

<li><span class="underline">Journalists and technologists</span><br/><ol class="org-ol"><li>Lanier<br/></li>
<li>Morozov<br/><div class="outline-text-6" id="text-5-3-1-2-2">
<p>
<a href="http://www.evgenymorozov.com">Morozov</a>
</p>

<p>
<a href="http://www.newrepublic.com/article/books-and-arts/magazine/105703/the-naked-and-the-ted-khanna">http://www.newrepublic.com/article/books-and-arts/magazine/105703/the-naked-and-the-ted-khanna</a>
</p>

<p>
<a href="http://www.nytimes.com/2013/03/17/opinion/sunday/morozov-open-and-closed.html?_r=0">http://www.nytimes.com/2013/03/17/opinion/sunday/morozov-open-and-closed.html?_r=0</a>
</p>
</div>
</li>
<li>Clay Shirky<br/></li>
<li>Kevin Kelley<br/><div class="outline-text-6" id="text-5-3-1-2-4">
<p>
<a href="http://kk.org/outofcontrol/contents.php">http://kk.org/outofcontrol/contents.php</a>
</p>
</div>
</li>
<li>CUNY's Lev Manovich<br/></li>
<li>Eben Moglen<br/><div class="outline-text-6" id="text-5-3-1-2-6">
<p>
<a href="http://moglen.law.columbia.edu">http://moglen.law.columbia.edu</a>
</p>
</div>
</li></ol>
</li>

<li><span class="underline">websites, periodicals and aggregators</span><br/><ol class="org-ol"><li>edge.org<br/><div class="outline-text-6" id="text-5-3-1-3-1">
<p>
see jaron lanier
</p>
</div>
</li>

<li>Wired<br/><div class="outline-text-6" id="text-5-3-1-3-2">
<p>
see Kevin Kelly
</p>
</div>
</li>

<li>lifehacker<br/><div class="outline-text-6" id="text-5-3-1-3-3">
<p>
<a href="http://lifehacker.com">http://lifehacker.com</a>
</p>
</div>
</li></ol>
</li></ol>
</div>

<div id="outline-container-sec-5-3-2" class="outline-4">
<h4 id="sec-5-3-2"><span class="section-number-4">5.3.2</span> the role of technology in the Western philosophical tradition</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
<a href="http://plato.stanford.edu/entries/technology/">http://plato.stanford.edu/entries/technology/</a>
</p>

<p>
<a href="http://plato.stanford.edu/entries/episteme-techne/">http://plato.stanford.edu/entries/episteme-techne/</a>
</p>

<p>
existentialism and Heidegger's Question Concerning Technology
Marshall McLuhan
Marx and alienation
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> reflections specifically on art and computation</h3>
<div class="outline-text-3" id="text-5-4">
</div><div id="outline-container-sec-5-4-1" class="outline-4">
<h4 id="sec-5-4-1"><span class="section-number-4">5.4.1</span> questions of aesthetics in the 21st Century</h4>
</div>
</div>

<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> before and after</h3>
<div class="outline-text-3" id="text-5-5">
</div><div id="outline-container-sec-5-5-1" class="outline-4">
<h4 id="sec-5-5-1"><span class="section-number-4">5.5.1</span> precursors and progenitors</h4>
<div class="outline-text-4" id="text-5-5-1">
<p>
MIT Media Lab
</p>

<p>
John C. Lilly
<a href="http://en.wikipedia.org/wiki/Human_biocomputer">http://en.wikipedia.org/wiki/Human_biocomputer</a>
<a href="http://deoxy.org/h_lilly.htm">http://deoxy.org/h_lilly.htm</a>
</p>

<p>
Stewart Brand
<a href="http://en.wikipedia.org/wiki/Whole_Earth_Catalog">http://en.wikipedia.org/wiki/Whole_Earth_Catalog</a>
</p>

<p>
Systems Theory
<a href="http://en.wikipedia.org/wiki/Gregory_Bateson">http://en.wikipedia.org/wiki/Gregory_Bateson</a>
</p>
</div>
</div>

<div id="outline-container-sec-5-5-2" class="outline-4">
<h4 id="sec-5-5-2"><span class="section-number-4">5.5.2</span> speculative fiction and philosophy&#x2013;or what did we learn from sci-fi?</h4>
<div class="outline-text-4" id="text-5-5-2">
<p>
the singularity, Moore's law and the end of everything
William Gibson et al
</p>
